In [1]:
import sqlite3
import os
import numpy as np
import pandas as pd

In [2]:
dbFileName = "test1.db"
dbFilePath = os.path.join(os.getcwd(), dbFileName)

In [3]:
def render_select_query(query):
    returnValue = pd.DataFrame(cur.execute(query))
    return returnValue

In [4]:
## Build up connection to database
## If file does not exist, will create the database file
con = sqlite3.connect(dbFilePath)

## instantiate a cursor object
cur = con.cursor()


## Question 1

In [5]:
## Create table
create_table_sql1 = """
Create table World (name varchar(255), continent varchar(255), area int, population int, gdp int);
"""

In [6]:
cur.execute(create_table_sql1)

In [7]:
insert_sql2 = """
insert into World (name, continent, area, population, gdp) values ('Afghanistan', 'Asia', '652230', '25500100', '20343000000')
"""
insert_sql3 = """
insert into World (name, continent, area, population, gdp) values ('Albania', 'Europe', '28748', '2831741', '12960000000')
"""
insert_sql4 = """
insert into World (name, continent, area, population, gdp) values ('Algeria', 'Africa', '2381741', '37100000', '188681000000')
"""
insert_sql5 = """
insert into World (name, continent, area, population, gdp) values ('Andorra', 'Europe', '468', '78115', '3712000000')
"""
insert_sql6 = """
insert into World (name, continent, area, population, gdp) values ('Angola', 'Africa', '1246700', '20609294', '100990000000')
"""
cur.execute(insert_sql2)
cur.execute(insert_sql3)
cur.execute(insert_sql4)
cur.execute(insert_sql5)
cur.execute(insert_sql6)

In [8]:
select_sql7 = """
SELECT * FROM World;
"""
render_select_query(select_sql7)

             0       1        2         3             4
0  Afghanistan    Asia   652230  25500100   20343000000
1      Albania  Europe    28748   2831741   12960000000
2      Algeria  Africa  2381741  37100000  188681000000
3      Andorra  Europe      468     78115    3712000000
4       Angola  Africa  1246700  20609294  100990000000

Question: A country is big if it has an area of bigger than 3 million square km or a population of more than 25 million.

Write a SQL solution to output big countries' name, population and area.

### Approch 1

In [9]:
select_sql8 = """
SELECT name, population, area FROM world WHERE area > 3000000 OR population > 25000000;
"""
render_select_query(select_sql8)

             0         1        2
0  Afghanistan  25500100   652230
1      Algeria  37100000  2381741

### Approch 2

In [10]:
select_sql9 = """
SELECT name, population, area FROM world WHERE area > 3000000
UNION
SELECT name, population, area FROM world WHERE population > 25000000
"""
render_select_query(select_sql9)

             0         1        2
0  Afghanistan  25500100   652230
1      Algeria  37100000  2381741


## Question 2

In [11]:
## Create table
create_table_sq21 = """
Create table Customers (Id int, Name varchar(255))
"""

In [12]:
cur.execute(create_table_sq21)

In [13]:
insert_sq22 = """
insert into Customers (Id, Name) values ('1', 'Joe')
"""
insert_sq23 = """
insert into Customers (Id, Name) values ('2', 'Henry')
"""
insert_sq24 = """
insert into Customers (Id, Name) values ('3', 'Sam')
"""
insert_sq25 = """
insert into Customers (Id, Name) values ('4', 'Max')
"""

cur.execute(insert_sq22)
cur.execute(insert_sq23)
cur.execute(insert_sq24)
cur.execute(insert_sq25)

In [14]:
## Create table
create_table_sq26 = """
Create table Orders (Id int, CustomerId int)
"""

In [15]:
cur.execute(create_table_sq26)

In [16]:
insert_sq27 = """
insert into Orders (Id, CustomerId) values ('1', '3')
"""
insert_sq28 = """
insert into Orders (Id, CustomerId) values ('2', '1')
"""
cur.execute(insert_sq27)
cur.execute(insert_sq28)

In [17]:
select_sq29 = """
SELECT * FROM Customers;
"""
render_select_query(select_sq29)

   0      1
0  1    Joe
1  2  Henry
2  3    Sam
3  4    Max

In [18]:
select_sq30 = """
SELECT * FROM Orders;
"""
render_select_query(select_sq30)

   0  1
0  1  3
1  2  1

Question: Suppose that a website contains two tables, the Customers table and the Orders table. Write a SQL query to find all customers who never order anything.

In [19]:
select_sq31 = """
select customers.name as 'Customers' from customers where customers.id not in (select customerid from orders)
"""
render_select_query(select_sq31)

       0
0  Henry
1    Max

## Question 3

In [20]:
## Create table
create_table_sq32 = """
Create table Log (Id int, Num int)
"""

cur.execute(create_table_sq32)

In [21]:
insert_sq33 = """
insert into Log (Id, Num) values ('1', '2')
"""

insert_sq34 = """
insert into Log (Id, Num) values ('2', '2')
"""
insert_sq35 = """
insert into Log (Id, Num) values ('3', '2')
"""
insert_sq36 = """
insert into Log (Id, Num) values ('4', '3')
"""
insert_sq37 = """
insert into Log (Id, Num) values ('5', '2')
"""
insert_sq38 = """
insert into Log (Id, Num) values ('6', '2')
"""
insert_sq39 = """
insert into Log (Id, Num) values ('7', '4')
"""

cur.execute(insert_sq33)
cur.execute(insert_sq34)
cur.execute(insert_sq35)
cur.execute(insert_sq36)
cur.execute(insert_sq37)
cur.execute(insert_sq38)
cur.execute(insert_sq39)

In [22]:
select_sq40 = """
SELECT * FROM Log;
"""
render_select_query(select_sq40)

   0  1
0  1  2
1  2  2
2  3  2
3  4  3
4  5  2
5  6  2
6  7  4

Question: Write a SQL query to find all numbers that appear at least three times consecutively

In [23]:
select_sq41 = """
SELECT DISTINCT
    l1.Num AS ConsecutiveNums
FROM
    Log l1,
    Log l2,
    Log l3
WHERE
    l1.Id = l2.Id - 1
    AND l2.Id = l3.Id - 1
    AND l1.Num = l2.Num
    AND l2.Num = l3.Num
"""
render_select_query(select_sq41)

   0
0  2